app/controllers/public_api/v1/public_api_controller.rb

SELECT  "countries".* FROM "countries" WHERE "countries"."country_code" = ?  ORDER BY "countries"."id" ASC LIMIT 1  [["country_code", "country_code=PL"]]
SELECT  "location_groups".* FROM "location_groups" WHERE "location_groups"."country_id" = ? AND "location_groups"."panel_provider_id" = ?  ORDER BY "location_groups"."id" ASC LIMIT 1  [["country_id", 1], ["panel_provider_id", 1]]
SELECT "locations".* FROM "locations" INNER JOIN "location_groups_locations" ON "locations"."id" = "location_groups_locations"."location_id" WHERE "location_groups_locations"."location_group_id" = ?  [["location_group_id", 1]]
---
  def locations
    c=Country.where(country_code: params[:country_code]).first
    puts c.location_groups.where(panel_provider_id: c.panel_provider_id).first.locations
    locations=c.location_groups.where(panel_provider_id: c.panel_provider_id).first.locations
    render json: locations.map { |loc| loc.as_json(only: [:id, :name, :external_id]) }