app/controllers/private_api/v1/private_api_controller.rb

  def locations
    c=Country.where(country_code: params[:country_code]).first
    render json: c.location_groups.where(panel_provider_id: c.panel_provider_id).first.locations.to_json
---
SELECT  "countries".* FROM "countries" WHERE "countries"."country_code" = ?  ORDER BY "countries"."id" ASC LIMIT 1  [["country_code", "PL"]]
SELECT  "location_groups".* FROM "location_groups" WHERE "location_groups"."country_id" = ? AND "location_groups"."panel_provider_id" = ?  ORDER BY "location_groups"."id" ASC LIMIT 1  [["country_id", 1], ["panel_provider_id", 1]]